app/views/post_images/show.html.erb

                          <i class="fa fa-heart-o" aria-hidden="true" style="color: red;"></i>
                          <%= @post_image.favorites.count %>いいね！
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."post_image_id" = ?  [["post_image_id", 2]]